"""
# P1045 [NOIP 2003 普及组] 麦森数

## 题目描述

形如 $2^{P}-1$ 的素数称为麦森数，这时 $P$ 一定也是个素数。但反过来不一定，即如果 $P$ 是个素数，$2^{P}-1$ 不一定也是素数。到 1998 年底，人们已找到了 37 个麦森数。最大的一个是 $P=3021377$，它有 909526 位。麦森数有许多重要应用，它与完全数密切相关。

任务：输入 $P(1000<P<3100000)$，计算 $2^{P}-1$ 的位数和最后 $500$ 位数字（用十进制高精度数表示）

## 输入格式

文件中只包含一个整数 $P(1000<P<3100000)$

## 输出格式

第一行：十进制高精度数 $2^{P}-1$ 的位数。

第 $2\sim 11$ 行：十进制高精度数 $2^{P}-1$ 的最后 $500$ 位数字。（每行输出 $50$ 位，共输出 $10$ 行，不足 $500$ 位时高位补 $0$）

不必验证 $2^{P}-1$ 与 $P$ 是否为素数。

## 输入输出样例 #1

### 输入 #1

```
1279
```

### 输出 #1

```
386
00000000000000000000000000000000000000000000000000
00000000000000000000000000000000000000000000000000
00000000000000104079321946643990819252403273640855
38615262247266704805319112350403608059673360298012
23944173232418484242161395428100779138356624832346
49081399066056773207629241295093892203457731833496
61583550472959420547689811211693677147548478866962
50138443826029173234888531116082853841658502825560
46662248318909188018470682222031405210266984354887
32958028878050869736186900714720710555703168729087
```

## 说明/提示

**【题目来源】**

NOIP 2003 普及组第四题
"""

import math


def quick_power(base, exponent, mod):
    res = 1
    while exponent > 0:
        if exponent & 1: # 如果 exponent 是奇数
            res = (res * base) % mod
        base = (base * base) % mod
        exponent >>= 1 # exponent //= 2
    return res


def compute_mersenne_number(P):
    # 求取位数
    """
    设 2^P 的位数有k 位，则有：
    10^k > 2^P >= 10^(k-1)
    由此可得：
    k > P * log10(2) >= k - 1
    因此：
    k = floor(P * log10(2)) + 1
    """
    log10_2 = math.log10(2)
    k = int(math.floor(P * log10_2)) + 1

    # 求取最后 500 位数字
    MOD = 10 ** 500
    tail = pow(2, P, MOD) - 1
    if tail < 0:
        tail += MOD

    s = str(tail).rjust(500, '0')
    return k, s
    

if __name__ == "__main__":
    # 读取输入
    P = int(input().strip())

    k, s = compute_mersenne_number(P)
    print(k)
    for i in 0, 50, 100, 150, 200, 250, 300, 350, 400, 450:
        print(s[i:i+50])

